cases/MRB_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//m4 definitions:



convertToMeters 1e-3;
// sizes go here
  // mm

























//m4_define(LCell,calc(int(L/cellSize)))
//m4_define(r1Cell,calc(int(r1/cellSize*3)))
//m4_define(r2Cell,calc(int(r2/cellSize*2)))
//m4_define(r3Cell,calc(int(r3/cellSize)))
//m4_define(r4Cell,calc(int(r4/cellSize*0.6)))









//m4_define(zCell,calc(int(zmax/cellSize)))


vertices
(

    (0 0  0)    //0
    (250 0  0)    //1
    (0 1.3 0)    //2
    (250 1.3 0)    //3
    (0 3.5 0)    //4
    (250 3.5 0)    //5
    (-8.04758771133671 20 0)    //6
    (250 20 0)    //7

    (0 0  5)    //8
    (250 0  5)    //9
    (0 1.3 5)    //10
    (250 1.3 5)    //11
    (0 3.5 5)    //12
    (250 3.5 5)    //13
    (-8.04758771133671 20 5)    //14
    (250 20 5)    //15
    
    (-12.9249135969953 30    0)    //16
    (250 30     0)    //17
    (-12.9249135969953 30 5)    //18
    (250 30  5)    //19
    
    (-17.8022394826539 40    0)    //20
    (250  40     0)   //21
    (-17.8022394826539 40 5)    //22
    (250  40  5)   //23
    
    (-17.8022394826539 200    0)    //24
    (250  200     0)   //25
    (-17.8022394826539 200 5)    //26
    (250  200  5)   //27
    
    (-22.9249135969953 40    0)    //28
    (-22.9249135969953 200    0)    //29
    (-22.9249135969953 40    5)    //30
    (-22.9249135969953 200    5)    //31
    
    (-22.9249135969953 20    0)    //32
    (-22.9249135969953 30    0)    //23
    (-22.9249135969953 20    5)    //34
    (-22.9249135969953 30    5)    //35


);

blocks
(
    hex (0 1 3 2 8 9 11 10)(250 20 10) simpleGrading (1 1 1) // 0
    hex (2 3 5 4 10 11 13 12)(250 20 10) simpleGrading (1 1 1) // 1
    hex (4 5 7 6 12 13 15 14)(250 80 10) simpleGrading (1 1 1) // 2
    hex (6 7 17 16 14 15 19 18)(250 40 10) simpleGrading (1 1 1) // 3
    hex (16 17 21 20 18 19 23 22)(250 40 10) simpleGrading (1 1 1) // 4
    hex (20 21 25 24 22 23 27 26)(250 40 10) simpleGrading (1 40 1) // 5
    hex (28 20 24 29 30 22 26 31)(10 40 10) simpleGrading (1 40 1) // 
    hex (32 6 16 33 34 14 18 35)(40 40 10) simpleGrading (1 1 1) // 


);

boundary
(
  INLET_JET
  {
  	type patch;
  	faces
  	(
  	    (0 8 10 2)
  	    
  	);
  }
  
  INLET_SLOT_1
  {
  	type patch;
  	faces
  	(
  	    (2 10 12 4)
  	    
  	);
  }
  
 INLET_SLOT_2
  {
  	type patch;
  	faces
  	(
  	    (32 34 35 33)
  	    
  	);
  }
  
 INLET_COFLOW
  {
  	type patch;
  	faces
  	(
  	    (28 30 31 29)
  	    
  	);
  }
 
WALL_BB_1
  {
  	type wall;
  	faces
  	(
  	    (4 12 14 6)
  	    (6 14 34 32)
  	    
  	);
  }

WALL_BB_2
  {
  	type wall;
  	faces
  	(
  	    (33 35 16 18)
  	    (16 18 22 20)
  	    (28 20 22 30)
  	    
  	);
  }

SIDE
  {
  	type wall;
  	faces
  	(
  	    (29 24 26 31)
  	    ( 24 25 27 26)
  	    
  	);
  }

OUTLET
  {
  	type patch;
  	faces
  	(
  	    (1 9 11 3 )
  	    ( 3 11 13 5)
  	    ( 5 13 15 7)
  	    (7 15 19 17)
  	    (17 19 23 21)
  	    (21 23 27 25)
  	    
  	);
  }

BACK
  {
  	type cyclic;
    neighbourPatch FRONT;
  	faces
  	(
  	    (0 2 3 1)
  	    (2 4  5 3)
  	    ( 4 6 7 5)
  	    (6 16 17 7)
  	    (32 33 16 6)
  	    (16 20 21 17)
  	    (20 24 25 21)
  	    (28 29 24 20)
  	    
  	);
  }

FRONT
  {
  	type cyclic;
    neighbourPatch BACK;
  	faces
  	(
  	    (8 9 11 10)
  	    ( 10 11 13 12)
  	    ( 12 13 15 14)
  	    (14 15 19 18 )
  	    (34 14 18 35)
  	    ( 18 19 23 22)
  	    ( 22 23 27 26)
  	    (30 22 26 31)
  	    
  	);
  }

AXIS
  {
  	type symmetry;
  	faces
  	(
  	    (8 9 1 0)
  	    
  	);
  }



);

mergePatchPairs
(
);

// ************************************************************************* //
