cases/MRB_2D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  PaSR<psiChemistryCombustion>;

active  true; // true

infinitelyFastChemistryCoeffs
{
    C       10.0;
}

PaSRCoeffs
{
    Cmix               1.0; 
    turbulentReaction   on; 
    useReactionRate     on;  
}


// ************************************************************************* //
