cases/MRB_2D/constant/sampleFaceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleFace;
}

interpolationScheme cell;
enabled         false;
outputControl   timeStep;
writeInterval   1e-6;

fields
(
    U rho T p Cmean T_LEM CO2 //prod_CO prod_OH
);

//surfaceFormat vtk;
//
//  surfaces
//  (
//      zPlane
//      {
//          type            plane;
//          interpolate     true;
//          triangulate     true;
//          normalVector    ( 0 0 1);
//          basePoint       ( 0 0 0.0005);
//      }
//  
//      
//  
//  );
//

