cases/MRB_2D/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
//dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    
    INLET_JET
    {
        type            zeroGradient;
    }
    
    INLET_SLOT_1
    {
        type            zeroGradient;
    }
    INLET_SLOT_2
    {
        type            zeroGradient;
    }
    
    INLET_COFLOW

    {
        type            zeroGradient;
    }
    
    
    OUTLET
    {
        type            fixedValue;
        value           uniform 101325;
    }
    
    WALL_BB_1
    {
        type            zeroGradient;
    }
    WALL_BB_2
    {
        type            zeroGradient;
    }
    
    WALL_JET
    {
        type            zeroGradient;
    }

    SIDE
    {
        type            zeroGradient;
    }
    FRONT
    {
        type            cyclic;
    }

    BACK
    {
        type            cyclic;
    }
    
    AXIS
    {
        type            symmetry;
    }
}


// ************************************************************************* //
