cases/MRB_2D/0.org/Zmean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Zmean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
    INLET_JET
    {
        type            fixedValue;
        value           uniform 0.131;
    }
    INLET_SLOT_1
    {
        type            fixedValue;
        value           uniform 0;
    }
    INLET_SLOT_2
    {
        type            fixedValue;
        value           uniform 0.044;
    }
    INLET_COFLOW
    {
        type            fixedValue;
        value           uniform 0;
    }
    WALL_BB_1
    {
        type            zeroGradient;
    }
    WALL_BB_2
    {
        type            zeroGradient;
    }
    SIDE
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    BACK
    {
        type            cyclic;
    }
    FRONT
    {
        type            cyclic;
    }
    AXIS
    {
        type            symmetry;
    }
}


// ************************************************************************* //
