cases/MRB_2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    
    "(p|rho)"
    {
     // solver          PCG;
     // preconditioner  DIC;

        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DICGaussSeidel;
    }


    "(p|rho)Final"
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }
    
    "(U|Cmean|Zmean|h|H_Tot|Yi)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

     // solver          smoothSolver;
     // smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.00;
    }
    
    "(U|Cmean|Zmean|h|H_Tot|Yi)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors     3;
    nOuterCorrectors 1 ;
    nNonOrthogonalCorrectors 0;

}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    h               0.7;
    nuTilda         0.7;
}

// ************************************************************************* //
