cases/MRB_2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refine;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-50.00e-3 -30e-3 -0.02) (0.1 30e-3 0.02);
         // box (-1. -1.0 -1.00 )(1 1 1);

        }
    }
);

// ************************************************************************* //
